API/app/controllers/v1/employees_controller.rb

    def index
      @employees = Employee.all
---
SELECT "employees".* FROM "employees"

    def create
      @employee = Employee.new(employee_params)

      if @employee.save
---
INSERT INTO "employees" ("user_id", "department", "manager_id", "position_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["department", "depA"], ["manager_id", 1], ["position_id", 1], ["created_at", "2023-01-09 18:35:20.740932"], ["updated_at", "2023-01-09 18:35:20.740932"]]

    def update
      if @employee.update(employee_params)
---
UPDATE "employees" SET "department" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["department", "Biuro"], ["updated_at", "2023-01-10 10:08:11.076683"], ["id", 1]]

    def destroy
      @employee.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 4]]

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]