API/app/controllers/v1/managers_controller.rb

    def index
      @managers = Manager.all
---
SELECT "managers".* FROM "managers"

    def create
      @manager = Manager.new(manager_params)

      if @manager.save
---
INSERT INTO "managers" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2023-01-09 18:32:58.180212"], ["updated_at", "2023-01-09 18:32:58.180212"]]

    def update
      if @manager.update(manager_params)
---
UPDATE "managers" SET "user_id" = ?, "updated_at" = ? WHERE "managers"."id" = ?  [["user_id", 3], ["updated_at", "2023-01-10 10:04:00.508236"], ["id", 2]]

    def destroy
      @manager.destroy
---
DELETE FROM "managers" WHERE "managers"."id" = ?  [["id", 2]]

      def set_manager
        @manager = Manager.find(params[:id])
---
SELECT "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]