API/app/controllers/v1/positions_controller.rb

    def index
      @positions = Position.all
---
SELECT "positions".* FROM "positions"

    def show
      @position = Position.find(params[:id])
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      @position = Position.new(position_params)

      if @position.save
---
INSERT INTO "positions" ("position_name", "salary", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["position_name", "manager"], ["salary", 5000], ["created_at", "2023-01-09 18:30:55.068038"], ["updated_at", "2023-01-09 18:30:55.068038"]]

    def update
      if @position.update(position_params)
---
UPDATE "positions" SET "position_name" = ?, "updated_at" = ? WHERE "positions"."id" = ?  [["position_name", "CEO"], ["updated_at", "2023-01-10 10:02:03.119986"], ["id", 5]]

    def destroy
      @position.destroy
---
DELETE FROM "positions" WHERE "positions"."id" = ?  [["id", 1]]

      def set_position
        @position = Position.find(params[:id])
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]