API/app/controllers/v1/registers_controller.rb

SELECT "registers".* FROM "registers"
---
    def index
      @registers = Register.all

INSERT INTO "registers" ("employee_id", "gate", "date_in", "time_in", "date_out", "time_out", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @register = Register.new(register_params)
      if @register.save

UPDATE "registers" SET "time_in" = ?, "time_out" = ?, "updated_at" = ? WHERE "registers"."id" = ?  [["time_in", "2000-01-01 08:00:00"], ["time_out", "2000-01-01 16:00:00"], ["updated_at", "2023-01-13 17:34:29.755454"], ["id", 5]]
---
    def update
      if @register.update(register_params)

DELETE FROM "registers" WHERE "registers"."id" = ?  [["id", 3]]
---
    def destroy
      @register.destroy

SELECT "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def set_register
        @register = Register.find(params[:id])