API/app/controllers/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "abc"], ["LIMIT", 1]]
---
    def login
      user = User.find_by_login(params[:login])