API/app/controllers/v1/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
      @users = User.all

INSERT INTO "users" ("login", "first_name", "last_name", "account_type", "email", "account_no", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      user = User.new(user_params)

      if user.save

UPDATE "users" SET "first_name" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["first_name", "yzz"], ["updated_at", "2023-01-13 17:00:44.389633"], ["password_digest", "[FILTERED]"], ["id", 11]]
---
    def update
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy
      @user.destroy