API/app/controllers/v1/vacations_controller.rb

SELECT "vacations".* FROM "vacations"
---
    def index
      @vacations = Vacation.all

INSERT INTO "vacations" ("employee_id", "start_date", "end_date", "vacation_type", "decision", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @vacation = Vacation.new(vacation_params)
      if @vacation.save

UPDATE "vacations" SET "decision" = ?, "updated_at" = ? WHERE "vacations"."id" = ?  [["decision", 0], ["updated_at", "2023-01-10 10:15:24.260249"], ["id", 2]]
---
    def update
      if @vacation.update(vacation_params)

DELETE FROM "vacations" WHERE "vacations"."id" = ?  [["id", 4]]
---
    def destroy
      @vacation.destroy

SELECT "vacations".* FROM "vacations" WHERE "vacations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
      def set_vacation
        @vacation = Vacation.find(params[:id])