API/app/controllers/v1/vacations_controller.rb

    def update
      @vacation = Vacation.new(vacation_params)
      if @vacation.save
---
INSERT INTO "vacations" ("employee_id", "start_date", "end_date", "vacation_type", "decision", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["employee_id", 1], ["start_date", nil], ["end_date", nil], ["vacation_type", nil], ["decision", 0], ["created_at", "2023-01-10 10:14:21.335836"], ["updated_at", "2023-01-10 10:14:21.335836"]]